app/views/events/_form.html.haml

  = f.input :status
  = collection_select :sitename, :site_id, Site.all, :id, :name, {prompt: "Select Intrested site"}, {class: "form-control"}
---
SELECT "sites".* FROM "sites"   ORDER BY "sites"."name" ASC