app/controllers/events_controller.rb

SELECT  "events".* FROM "events"   ORDER BY "events"."id" ASC LIMIT 1
---
  def index
    @events = Event.all

INSERT INTO "events" ("budget", "created_at", "description", "finish", "name", "phone", "site_id", "start", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "sites".* FROM "sites"  WHERE "sites"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "events" SET "sitename" = $1, "updated_at" = $2 WHERE "events"."id" = 4  [["sitename", "vijaynagar"], ["updated_at", "2015-04-27 10:37:55.046221"]]
---
  def create
    @event = Event.create(event_params)
    @event.update_attribute(:sitename, Site.find(params[:sitename][:site_id].to_i).name)

UPDATE "events" SET "finish" = $1, "start" = $2, "updated_at" = $3 WHERE "events"."id" = 7
SELECT  "sites".* FROM "sites"  WHERE "sites"."id" = $1 LIMIT 1  [["id", 0]]
UPDATE "events" SET "all_day" = $1, "updated_at" = $2 WHERE "events"."id" = 4
---
  def update
    @event.update_attributes(event_params)
    @event.update_attribute(:sitename, Site.find(params[:sitename][:site_id].to_i).name)