app/controllers/sites_controller.rb

	def index
	  @sites = Site.all
---
SELECT "sites".* FROM "sites"

	def create
		@site = Site.create(site_params)
---
INSERT INTO "sites" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-04-27 07:45:38.043303"], ["name", "hashmi"], ["updated_at", "2015-04-27 07:45:38.043303"]]

	def destroy
        @site.destroy
---
DELETE FROM "sites" WHERE "sites"."id" = $1  [["id", 5]]

	def set_site
		@site = Site.find(params[:id])
---
SELECT  "sites".* FROM "sites"  WHERE "sites"."id" = $1 LIMIT 1  [["id", 5]]